{"posts":[{"title":"Un site qui prend toute la hauteur disponible","author":"Emmanuel B.","date":"2015-10-25 22:35:01","tags":["html/css"],"categories":["Tutoriels"],"template":"post.vue","basename":"prend-toute-la-hauteur-disponible","content":"<p>Lorsqu&#39;on crée un design dont la particularité est que le pied de page soit toujours au bas de l’écran, on se heurte à un petit soucis de conception : comment définir une hauteur minimale à la fenêtre ?</p>\n<p>Nous allons voir plusieurs solutions possibles, à choisir en fonction de vos besoins.</p>\n<p>&lt;!--more--&gt;\n</p>\n<p>&lt;div class=&quot;note note--info&quot;&gt;Ce tutoriel date un peu (2013), mais je suis en train de lui faire une petite remise à jour, incluant de nouvelles méthodes plus modernes et plus efficaces. Je n’ai pas encore détaillé toutes ces nouvelles méthodes, mais le code est disponible.&lt;/div&gt;\n\n</p>\n<p>Tout d’abord, comprenons bien de quoi l’on parle dans ce tutoriel, et pour cela, nous allons d’abord illustrer le problème.</p>\n<p>Lorsqu&#39;un site possède une hauteur totale plus grande que l’écran sur lequel il est vu, on peut alors descendre la page vers le bas, jusqu&#39;au bas de la page en question ; là, le défilement est arrêté, le pied-de-page, ou &quot;footer&quot; en anglais, est alors fixé naturellement au bas de la page et de l’écran.</p>\n<p><img src=\"https://www.emmanuelbeziat.com/wp-content/uploads/2013/07/tuto1-01.png\" alt=\"Illustration du tutoriel\"> <img src=\"https://www.emmanuelbeziat.com/wp-content/uploads/2013/07/tuto1-02.png\" alt=\"Illustration du tutoriel\"></p>\n<p>Mais dans le cas où la hauteur totale de la page est inférieure à la hauteur de l’écran, alors le pied-de-page, toujours placé au bas de la page, n’atteint pas le bas de l’écran.</p>\n<p><img src=\"https://www.emmanuelbeziat.com/wp-content/uploads/2013/07/tuto1-03.png\" alt=\"Illustration du tutoriel\"></p>\n<p>Si certains design ne sont pas gênés par cette éventualité, ce n’est pas le cas de tous. Pour palier à ce problème, nous allons devoir faire en sorte que le design adopte la taille du contenu si la taille de la page est supérieure à la taille de l’écran, mais que la taille minimale de la page ne puisse pas être inférieure cette dernière.</p>\n<p><img src=\"https://www.emmanuelbeziat.com/wp-content/uploads/2013/07/tuto1-04.png\" alt=\"Illustration du tutoriel\"></p>\n<p>Nous allons maintenant voir comment faire ceci.</p>\n<h2 id=\"la-vieille-m-thode-ie-7-\">La vieille méthode (IE 7+)</h2>\n<h3 id=\"le-html\">Le html</h3>\n<p>Nous partons sur cette base html :</p>\n<pre><code class=\"html\">&lt;div class=&quot;page&quot;&gt;\n    &lt;div class=&quot;bloc-principal&quot;&gt;\n        &lt;header class=&quot;site-header&quot;&gt;&lt;/header&gt;\n        &lt;main class=&quot;site-content&quot;&gt;\n            &lt;div class=&quot;sidebar&quot;&gt;&lt;/div&gt;\n            &lt;div class=&quot;texte&quot;&gt;&lt;/div&gt;\n        &lt;/main&gt;&lt;!-- contenu --&gt;\n    &lt;/div&gt;&lt;!-- fin bloc-principal --&gt;\n    &lt;footer class=&quot;main-footer&quot;&gt;&lt;/footer&gt;\n&lt;/div&gt;&lt;!-- fin page --&gt;\n</code></pre>\n<p>Ce n’est qu&#39;un exemple de site de base ; vous pouvez bien sûr utiliser votre propre site.</p>\n<p><img src=\"https://www.emmanuelbeziat.com/wp-content/uploads/2013/07/tuto1-05.png\" alt=\"Illustration du tutoriel\"></p>\n<p>&lt;div class=&quot;note note--question&quot;&gt;Pourquoi mettre le pied de page (footer) en dehors du bloc principal ?&lt;/div&gt;\n\n</p>\n<p>Toute l’astuce est là, c&#39;est le fait de placer le pied-de-page en dehors du bloc du contenu qui va permettre de le fixer au bas de la page, mais aussi de l’empêcher de passer par-dessus le texte du contenu.</p>\n<h3 id=\"le-css-en-action\">Le CSS en action</h3>\n<p>La première étape est donc de donner à <code>&lt;html&gt;</code> une hauteur de 100% (correspondant à toute la hauteur de la fenêtre), qui servira de hauteur de référence pour les balises enfants et les valeurs en pourcentage que nous allons leur donner par la suite. En effet, la valeur relative &quot;100%&quot; doit correspondre à quelque chose : c&#39;est donc &quot;100% de la fenêtre&quot; pour <code>&lt;html&gt;</code>. La première balise enfant étant <code>&lt;body&gt;</code>, nous lui attribuons également cette valeur pour qu&#39;elle adote une hauteur de &quot;100% de <code>&lt;html&gt;</code>&quot;. Ainsi, nous pourrons positionner le footer facilement au bas de l’écran dans sa position &quot;minimale&quot;.</p>\n<pre><code class=\"css\">html, body { height: 100% }\n</code></pre>\n<p>N’oubliez pas d’ajouter ultérieurement un <code>margin: 0</code> sur <code>body</code> afin de ne pas avoir de barre de défilement.</p>\n<p>Il nous faut ensuite donner à notre conteneur principal, &quot;page&quot;, une hauteur de 100%. Mais nous n’allons pas utiliser la propriété height, car celle-ci défini une hauteur définitive ; à la place, nous ferons usage de <code>min-height</code>, qui défini une hauteur minimale pour le conteneur : ainsi, Si la fenêtre est plus grande que la page, alors le conteneur prendra toute la hauteur disponible, mais ne sera jamais plus petite que 100% -soit la taille du contenu de la page- et ne chevauchera donc jamais ledit contenu.</p>\n<p>Il faut également préparer le positionnement du pied-de-page au bas du conteneur, aussi nous appliquons un paramètre de position relative à page.</p>\n<pre><code class=\"css\">.page {\n    min-height: 100%;\n    position: relative;\n}\n</code></pre>\n<p>Nous passons maintenant au conteneur <code>bloc-principal</code>. L’astuce consiste à lui attribuer une marge interne de la hauteur du pied-de-page (ici, 100px). Cela a pour but de bien définir la fin du conteneur à la fin de son contenu. Sans ce paramètre, vous vous rendrez compte que le pied-de-page se superposerait au bas du contenu sur 120px, soit sa propre hauteur.</p>\n<pre><code class=\"css\">.bloc-principal {\n    padding-bottom: 100px;\n}\n</code></pre>\n<p>Maintenant, nous nous attaquons au pied-de-page. Il faut que celui-ci ait tout d’abord une hauteur définie (même s&#39;il s&#39;agit d’un pourcentage), puis il faut lui affecter un positionnement absolu. Comme son parent direct, le conteneur <code>page</code>, est en positionnement relatif, <code>footer</code> se sert de cette référence pour savoir où se positionner. Enfin, grâce au positionnement absolu, il suffira d’accrocher le conteneur au bas du bloc parent. On ajoute également <code>left</code> et <code>right</code> afin que le bloc prenne toute la largeur.</p>\n<pre><code class=\"css\">.site-footer {\n    height: 100px;\n    position: absolute;\n    bottom: 0;\n    left: 0;\n    right: 0;\n}\n</code></pre>\n<p>Et nous y voici ! Il est à noter que le pied de page doit avoir du contenu pour être affiché, à cause de son positionnement absolu.</p>\n<p>Vous pouvez voir le code en action sur <a href=\"http://codepen.io/EmmanuelB/pen/rfCey\">Codepen</a>.</p>\n<h2 id=\"la-m-thode-interm-diaire-ie-8-\">La méthode intermédiaire (IE 8+)</h2>\n<p>Voici une méthode utilisant les propriétés <code>display: table-*</code> :</p>\n<pre><code class=\"html\">&lt;body&gt;\n    &lt;div class=&quot;page&quot;&gt;\n        &lt;header class=&quot;site-header&quot;&gt;&lt;/header&gt;\n\n        &lt;main class=&quot;site-content&quot;&gt;&lt;/main&gt;\n\n        &lt;footer class=&quot;site-footer&quot;&gt;&lt;/footer&gt;\n    &lt;/div&gt;\n&lt;/body&gt;\n</code></pre>\n<pre><code class=\"css\">html,\nbody {\n    height: 100%\n}\n\nbody {\n    margin: 0\n}\n\n.page {\n    display: table;\n    width: 100%;\n    height: 100%;\n}\n\n.site-header,\n.site-content,\n.site-footer {\n    display: table-row\n}\n</code></pre>\n<p>Ainsi, on obtient le même résultat, avec moins d’efforts. Il sera toutefois nécessaire de spécifier une hauteur (ou une hauteur maximale) au header et au footer.</p>\n<h2 id=\"la-m-thode-moderne-ie-9-\">La méthode moderne (IE 9+)</h2>\n<p>Cette méthode nécessite qu&#39;on connaisse la hauteur du pied de page.</p>\n<p>Nous avons besoin de cette base html :</p>\n<pre><code class=\"html\">&lt;div class=&quot;bloc-principal&quot;&gt;\n    &lt;div class=&quot;site-header&quot;&gt;&lt;/div&gt;\n    &lt;main class=&quot;contenu&quot;&gt;\n    &lt;/main&gt;\n&lt;/div&gt;\n&lt;div class=&quot;site-footer&quot;&gt;&lt;/div&gt;\n</code></pre>\n<p>Puis nous allons utiliser une simple astuce à base de <code>vh</code> et de <code>calc()</code>. Pour expliquer très sommairement, <code>vh</code> permet de définir une hauteur relative au <em>viewport</em> (la fenêtre de navigation), et <code>calc()</code> permet de faire une opération simple en CSS. Pour toute information complémentaire, consultez votre moteur de recherche préféré !</p>\n<p>Partons du principe que notre pied de page fait ici 40px de haut.</p>\n<pre><code class=\"css\">body {\n    margin: 0\n}\n\n.bloc-principal {\n    min-height: calc(100vh - 40px)\n}\n</code></pre>\n<p>Hé oui, c&#39;est tout. On dit au bloc principal de faire au minimum la totalité de la hauteur de la fenêtre, moins la hauteur du pied de page. Malin, non ?</p>\n<h2 id=\"la-m-thode-moderne-am-lior-e-ie-10-\">La méthode moderne améliorée (IE 10+)</h2>\n<p>Pour celle-ci, on va utiliser <code>flexbox</code>, une propriété toute récente, dont je vous invite à <a href=\"http://caniuse.com/#feat=flexbox\" title=\"CanIUse Flexbox ?\">vérifier la compatibilité</a>.</p>\n<p>&lt;div class=&quot;note note--important&quot;&gt;Flexbox n’est pas sensé être utilisé pour un gabarit de page, c&#39;est normalement le module CSS <code>grid</code> à qui revient cette charge. Cependant, l’écriture des spécifications de <code>flexbox</code> est presque terminé et la propriété est implémentée dans tous les navigateurs modernes, alors que <code>grid</code> est encore en <em>working draft</em>, et n’est implémenté que dans Internet Explorer 10+ et Edge.&lt;/div&gt;\n\n</p>\n<pre><code class=\"html\">&lt;body&gt;\n    &lt;div class=&quot;page&quot;&gt;\n        &lt;header class=&quot;site-header&quot;&gt;&lt;/header&gt;\n\n        &lt;main class=&quot;site-content&quot;&gt;&lt;/main&gt;\n\n        &lt;footer class=&quot;site-footer&quot;&gt;&lt;/footer&gt;\n    &lt;/div&gt;\n&lt;/body&gt;\n</code></pre>\n<p>Nous allons donc simplement appliquer <code>display: flex;</code> à <code>body</code>, et spécifier le comportement de ses descendants direct en tant que colonnes. Puis nous diront simplement à <code>.site-content</code> d’utiliser toute la hauteur disponible.</p>\n<pre><code class=\"css\">body {\n    margin: 0;\n    display: flex;\n    flex-direction: column;\n    min-height: 100vh;\n}\n\n.site-content {\n    flex: 1;\n}\n</code></pre>\n<p>C&#39;est tout !</p>\n<h2 id=\"la-m-thode-de-demain\">La méthode de demain</h2>\n<p>À priori, il viendra un temps où nous utiliseront le module grid afin de faire le squelette de notre site (Et flexbox sera utilisé pour la gestion fine du contenu). Pour en savoir plus, je vous suggère de lire <a href=\"http://www.alsacreations.com/article/lire/1388-css3-grid-layout.html\">cet article sur Alsacréations</a>.</p>\n"},{"title":"Le nouveau logo d'Instagram ? On s'en fout !","author":"Emmanuel B.","date":"2016-05-27 04:24:14","tags":["design"],"categories":["Diatribes"],"template":"post.vue","basename":"logo-dinstagram-on-sen-fout","content":"<p>C&#39;est LE grand événement qui secoue la toile. La famine, la guerre ne comptent plus. Même Nabilla est reléguée au second plan médiatique. Parce qu’être Charlie ça va un temps, mais il ne faut pas non plus exagérer ! Oui, aujourd’hui, le grand malheur d&#39;internet, c’est <strong>le nouveau logo d&#39;Instagram</strong>.</p>\n<p>Si si, je te jure. Parce qu’il est tellement moche que &lt;q&gt;même mon petit frère fait mieux sous paint&lt;/q&gt; (j’ai déjà entendu ça quelque part…).</p>\n<p>D’ordinaire, je me tamponne littéralement l’oreille de toutes ces tragédies qui secouent le merveilleux quotidien des braves gens (qui n’aiment pas que l’on suive une autre route qu’eux ♪♫). Mais le débat dérive beaucoup sur le <em>flat design</em>, et comme le design j’aime bien ça (et le flat design aussi)… Hé ben maintenant, j’ai envie d’en parler aussi !</p>\n<p>Et je vais commencer par le point que tout le monde semble ne pas voir :</p>\n<p>&lt;!--more--&gt;\n</p>\n<h2 id=\"le-vieux-logo-tait-mauvais-\">Le vieux logo était mauvais !</h2>\n<p>Boum, j’attaque direct ! Ça dénonce sévère ici !</p>\n<p>Non mais sérieusement, je vais étayer un peu mon propos, et en arriver à la conclusion précédemment citée (qui en fait sert d’introduction, parce que je regarde plein de documentaires conspirationnistes alors je sais comment on fait pour persuader n’importe qui de n’importe quoi).</p>\n<h2 id=\"qu-est-ce-qui-fait-un-bon-logo-\">Qu’est-ce qui fait un bon logo ?</h2>\n<p>Le logo, c’est la tête d’une marque. Un bon logo est un signe fort, une garantie de reconnaissance, d’une facilité marketing. Pour faire un bon logo, <strong>il faut une bonne idée</strong>. Quelque chose d’original, de marquant, d’ingénieux, ou d’original (ou encore mieux : tout à la fois !).</p>\n<p>On reconnaît un excellent logo (et un excellent <strong>branding</strong> en général) au fait qu’il soit intemporel. Par exemple, le logotype d’une célèbre boisson gazeuse à base de feuille de coca, pratiquement inchangé depuis plus d’un siècle : aucune ride, aucun doute possible. Une typo qui est toujours dans l’air du temps, que ce soit en 1920, en 1987 ou en 2016. Exemple d’un mauvais <em>branding</em> : son concurrent de toujours, qui a eu tellement de logos, de typographies et d’années d’errances visuelles qu’il est impossible à la majorité de la population de le décrire de tête (faites l’expérience).</p>\n<p>Alors certes, le logo de la marque du père-noël (je vous avais dit que j’aime regarder des vidéos avec des théories débiles !) n’est pas un modèle d’ingéniosité, mais il marche parfaitement (et on verra pourquoi ci-après). Mais des idées de logos superbement créatifs, on en trouve à la pelle sur internet : <a href=\"http://www.awwwards.com/99-creative-logo-designs-for-inspiration.html\">99 creative logo designs for inspiration</a>. Regardez &quot;Fish Food&quot;, &quot;Loveclip&quot;, &quot;Motion&quot;, &quot;Fence&quot;, &quot;Turn&quot;, &quot;Twins&quot;, &quot;Up&quot;, &quot;Antartica&quot;, &quot;One&quot;, &quot;Cook Finder&quot;, &quot;Horror Films&quot;, &quot;Rocket Golf&quot;, &quot;Lab&quot;, &quot;Killed&quot;, &quot;Sushi&quot;, &quot;Choose&quot;, &quot;Bison&quot;, &quot;Wiesinger Music&quot;, &quot;Pencil&quot;… À chaque fois, une idée simple mais brillante. Un logo simple mais ingénieux. Il y en a plein, cherchez-en d’autres !</p>\n<p>Mais surtout, vous avez noté ? Tous ces logos… Ils ne seraient pas un peu <em>flat design</em>, peuchère ?</p>\n<h2 id=\"les-effets-quoi-a-sert-\">Les effets, à quoi ça sert ?</h2>\n<p>En effet, un bon logo n’a besoin d’aucun artifice ! Récemment (bon, ok, il y a 10 ans), la mode du « web 2.0 » — propulsée par l’accès au haut-débit pour tous, le piratage facile de Photoshop et la démocratisation de l’informatique à domicile même chez les prolos comme moi — nous apportait une vague d’amateurisme dans le monde du design et du web (va checker mon super article &lt;q&gt;<a href=\"https://www.emmanuelbeziat.com/blog/linformatique-facile-ma-tue/\">L’informatique facile m’a tué</a>&lt;/q&gt;, j’cause du sujet). L’amateurisme, avec sa bite et son couteau, a décidé de planquer son manque d’inspiration derrière une ignoble mode du « shiny-glossy-3d-futuro-classy-owi-owi-tu-la-sens-bien-ma-trentaine-de-filtres-toshop », déjà bien engagée par Aqua (Apple) et Aero (Microsoft).</p>\n<p>Aucun besoin d’être original ou créatif : tant qu&#39;il y a plein de reflets et d’ombres, c’est trop la classe. MarieJulien en parlent très bien ici (avec de bons exemples) : &lt;q&gt;<a href=\"http://mariejulien.com/post/2007/12/10/Tutorial-illustrator%3A-comment-faire-un-bon-gros-logo-web20-qui-tache\">Tutorial Illustrator : comment faire un bon gros logo web 2.0 qui tâche</a>&lt;/q&gt;.</p>\n<p>Alors encore une fois, c’est là de la bonne grosse généralité : tout ce qui a des effets n’est pas moche ou à jeter. Mais on a vraiment assisté à une bonne décennie d’agression visuelle et mentale, la médiocrité et la pauvreté créative masquée habilement derrière la « technique » (je me gausse).</p>\n<h2 id=\"un-bon-logo-design-n-a-pas-besoin-d-artifices\">Un bon logo/design n’a pas besoin d’artifices</h2>\n<p>C’est tout.</p>\n<p>Fort de toutes ces réflexions, regardons le logo d&#39;Instagram : c’est un polaroïd. Bon.</p>\n<p>Et ? Hé ben c’est tout. C’est aussi nul que ça. Le logo de Kodak était mieux foutu : il intégrait un appareil photo dans l’initiale du nom de la marque. Mais là, non. C’est nul. Vide. Creux.</p>\n<p>Des logos comme ça, même moi qui suis aussi créatif qu’une pelle, je peux en faire plein ! Nike ? Mmmh, allez, une godasse de sport avec des reflets, ça va le faire ! Pour Carrefour, mmh… J’imagine bien un caddie, mais stylisé tu vois ? McDo par contre c’est facile : un hamburger, avec des ombres sur le côté droit.</p>\n<p>Alors entendons-nous bien : un appareil photo, une babouche, ou une rondelle de steak, ça peut être de très bonnes idées ; mais à la condition seulement d’avoir l’étincelle créative (et le travail qui va avec) qui rendra le tout ingénieux. Comme pour &quot;Fish Food&quot;, &quot;Fence&quot;, etc. Parce que sans ça, c’est juste l’illustration du sujet, et ça n’a aucun intérêt.</p>\n<p>Alors oui : le nouveau logo d’Instagram est moche. Basique, simple, et n’exprime rien. Mais <strong>ce n’est pas une question de flat design</strong> ! Ce logo a toujours été mauvais. La base est basique, simple et n’exprime rien non plus ! Et le fait de l’avoir &lt;del&gt;sobrement&lt;/del&gt; décoré de jolis reflets, de petites ombres et de trois couches de <em>lens flare</em> (coucou J.J Abrahams !) ne peut rien y changer.</p>\n<h4 id=\"avec-une-id-e-de-base-foireuse-le-r-sultat-sera-pourri-peu-importe-le-traitement-\">Avec une idée de base foireuse, le résultat sera pourri ; peu importe le traitement.</h4>\n<p>Un exemple visuel pour s’en convaincre dans ce très bon article : &lt;q&gt;<a href=\"http://roberthacala.com/are-you-a-victim-of-bad-brand-design\" title=\"Robert Hacala\">Are you victim of a bad brand design? — Robert Hacala</a>&lt;/q&gt;.</p>\n<p>À la limite, ce nouveau logo Instagram intègre l’idée de filtre de tons, ce qui est quand même LE truc qui a rendu l’app populaire (rendre les photos quelconques et moches intéressantes en leur donnant un semblant de personnalité grâce à des filtres). Donc ma foi, celui-ci est peut-être plus dans le ton (haha !) que son prédécesseur.</p>\n<p>Bref, arrêtez d’étaler votre haine sur Twitter, pitié. Vous vous souvenez du tout premier logo de l’app (c’est une question rhétorique, je sais que vous ne vous en souvenez pas ; vous ne le connaissez probablement même pas) ? Bon, dans trois mois ce sera pareil avec le nouveau : vous ne vous souviendrez pas du précédent.</p>\n<p>Si vous avez peur du moindre changement, sachez qu’il existe une règle :</p>\n<blockquote>\n<p>La version <em>n-1</em> semble toujours meilleure que la version <em>n</em>. Vous oublierez toujours que vous avez craché la version <em>n-1</em> à sa sortie, et vous cracherez toujours sur la version <em>n+1</em> quand elle sortira.</p>\n</blockquote>\n<h2 id=\"un-point-sur-le-flat-design\">Un point sur le flat design</h2>\n<h3 id=\"le-flat-a-toujours-exist-\">Le flat a toujours existé</h3>\n<p>Il évolue, il grandit, il change, mais il a toujours été là. Non, ce n’est pas une mode : c’est un rafraichissant retour à la moelle du métier.</p>\n<p>Concrètement, on vient de voir que ce qui fait un bon logo / design, c’est l’idée qu’il véhicule, et comment il respecte (voire sublime) la thématique de la marque ou de l’entreprise. Et l’exemple de tous les logos géniaux que j’ai montré plus haut est parlant. Une bonne idée n’a pas besoin de se cacher derrière des effets. On peut même faire le pronostic inverse : si un logo / design est bourré d’effets, c’est probablement qu’il compense un manque de bonnes idées.</p>\n<p>Un bon logo doit pouvoir être réutilisé sur n’importe quel support, à n’importe quel taille, être toujours reconnaissable avec une seule couleur, avec un contraste différent… Bref, il doit être à l’épreuve de tout. Si le fait d’enlever un effet rend le tout brouillon, difficile à comprendre ou reconnaître, c’est que son design est mauvais. Et la simplicité du <em>flat</em>, sous toutes ses formes (comme le <strong>Material design</strong> de Google) est une réponse logique et cohérente.</p>\n<p>Le <em>flat</em> est un ensemble de règles de création, rien de plus. Il n’oblige personne à faire un carré biseauté, un rond et un point pour représenter un appareil photo. Il pose juste les bases pour obtenir un résultat simple, sobre et exploitable en toutes circonstances.</p>\n<p>C’est comme avec n’importe quel courant artistique : on peut faire du très bon cubisme, du très mauvais académique, du baroque raté, de l’impressionnisme génial, et de l’art moderne intéressant. Il en va de même pour le flat ou pour le glossy.</p>\n<h3 id=\"la-connerie\">La connerie</h3>\n<p>Au cours d’un « débat » sur le <em>flat design</em>, quelqu’un m’a sorti une excellente ânerie : &lt;q&gt;Le cerveau est habitué à voir des objets réels, il a besoin de détails pour reconnaître un objet, sinon ça le fatigue !&lt;/q&gt;</p>\n<p>À quiconque croirait à ces stupides sornettes, laissez-moi vous montrer ceci :</p>\n<p><img src=\"https://www.emmanuelbeziat.com/wp-content/uploads/2016/05/smile-flat.png\" alt=\"smile-flat\"></p>\n<p>Vous avez immédiatement vu un visage qui sourit (sinon, c’est que vous avez probablement un problème neuronal ; ou que vous êtes d’une extrême mauvaise foi). Alors que si on est un peu honnête, il ne s’agit pas d’un visage, mais d’un cercle et de trois courbes.</p>\n<p>Au contraire de cette affirmation stupide, le cerveau est parfaitement capable de reconnaître très rapidement une représentation simple d’un objet comme étant l’objet lui-même. C’est une question de survie.</p>\n<p>Pour en savoir un peu plus, je vous recommande cette vidéo de la géniale chaîne YouTube <a href=\"\">e-penser</a> : &lt;q&gt;10 choses insensées que votre cerveau sait faire sans e-penser&lt;/q&gt;. Il y a justement dedans le sujet de la paréidolie.</p>\n<p>&lt;div class=&quot;video&quot;&gt;&lt;iframe src=&quot;https://www.youtube.com/embed/7GiQuG2S26Q&quot; allowfullscreen&gt;&lt;/iframe&gt;&lt;/div&gt;\n</p>\n"}]}
